
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2018 GRank 报告 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter active" data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    2018 GRank 报告
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >2018 GRank 报告</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="grank-2018-&#x62A5;&#x544A;">Grank 2018 &#x62A5;&#x544A;</h1>
<p>&#x672C;&#x7BC7;&#x4EE5; GitHub &#x6570;&#x636E;&#x4E3A;&#x57FA;&#x7840;&#xFF0C;&#x6309;&#x7167;&#x8BBE;&#x5B9A;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x91C7;&#x96C6;&#x3001;&#x805A;&#x7C7B;&#x548C;&#x5206;&#x6790;&#x5F00;&#x6E90;&#x751F;&#x6001;&#x7684;&#x72B6;&#x6001;&#x3002;&#x672C;&#x7BC7;&#x4F5C;&#x4E3A;&#x300A;&#x4E2D;&#x56FD;&#x5F00;&#x6E90;&#x8C03;&#x67E5;&#x62A5;&#x544A;&#x300B;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x53E6;&#x5916;&#x4E00;&#x79CD;&#x4ECE;&#x6570;&#x636E;&#x7684;&#x89C6;&#x89D2;&#x6765;&#x89C2;&#x5BDF;&#x4E2D;&#x56FD;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x53D1;&#x5C55;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>Grank &#x662F;&#x672C;&#x62A5;&#x544A;&#x5236;&#x5B9A;&#x7684;&#x4E00;&#x4E2A;&#x6307;&#x6570;&#xFF0C;&#x7528;&#x4E8E;&#x7EFC;&#x5408;&#x8BC4;&#x4F30;&#x4E00;&#x4E2A;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x3001;&#x5F00;&#x6E90;&#x7EC4;&#x7EC7;&#x7684;&#x5065;&#x5EB7;&#x7A0B;&#x5EA6;&#x3002;</p>
<p><strong>Grank &#x6A21;&#x578B;&#x4ECB;&#x7ECD;</strong></p>
<p>&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#xFF0C;&#x4E00;&#x4E2A;&#x5065;&#x5EB7;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x5E94;&#x8BE5;&#x4F53;&#x73B0;&#x4E3A;&#x4EE5;&#x4E0B;&#x4E24;&#x4E2A;&#x65B9;&#x9762;&#xFF1A;</p>
<ul>
<li>&#x9879;&#x76EE;&#x7684;&#x6D3B;&#x8DC3;&#x5EA6;&#x8D8B;&#x52BF;</li>
<li>&#x9879;&#x76EE;&#x7684;&#x793E;&#x533A;&#x5316;&#xFF08;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#xFF09;&#x7A0B;&#x5EA6;</li>
</ul>
<p>&#x800C;&#x8FD9;&#x4E24;&#x4E2A;&#x65B9;&#x9762;&#x5206;&#x522B;&#x6709;&#x591A;&#x4E2A;&#x56E0;&#x7D20;&#x7EC4;&#x6210;&#xFF1A;</p>
<p><strong>&#x6D3B;&#x8DC3;&#x5EA6;&#x548C;&#x6D3B;&#x8DC3;&#x5EA6;&#x8D8B;&#x52BF;</strong></p>
<p>&#x9879;&#x76EE;&#x7684;&#x6D3B;&#x8DC3;&#x5EA6;&#xFF0C;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x4E3A;&#x9879;&#x76EE;&#x7684;&#x63D0;&#x4EA4;&#x6570;&#x3001; &#x62C9;&#x53D6;&#x8BF7;&#x6C42;&#x6570;&#x548C;&#x8D21;&#x732E;&#x8005;&#x6570;&#xFF08;&#x5176;&#x5B83;&#x6570;&#x636E;&#xFF0C;&#x5982;&#x4EE3;&#x7801;&#x884C;&#x6570;&#x3001;&#x6587;&#x4EF6;&#x6570;&#x3001;issue &#x6570;&#x3001; fork &#x6570;&#x3001;star &#x6570;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x6743;&#x91CD;&#x76F8;&#x5BF9;&#x4F4E;&#x5F97;&#x591A;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x4EE3;&#x8868;&#x610F;&#x4E49;&#x4E0D;&#x591F;&#x786E;&#x5B9A;&#xFF0C;&#x6B64;&#x5904;&#x5FFD;&#x7565;&#x4E0D;&#x8BA1;&#x5165;&#x6A21;&#x578B;&#xFF09;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x5176;&#x6A2A;&#x5411;&#x6BD4;&#x8F83;&#x5176;&#x6D3B;&#x8DC3;&#x5EA6;&#xFF0C;&#x6216;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x6D3B;&#x8DC3;&#x5EA6;&#x5F62;&#x6001;&#xFF0C;&#x6216;&#x4E0D;&#x5177;&#x5907;&#x53EF;&#x6BD4;&#x6027;&#x3002;&#x5F88;&#x96BE;&#x8BF4;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x6BD4;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x63D0;&#x4EA4;&#x6570;&#x9AD8;&#xFF0C;&#x800C;&#x62C9;&#x53D6;&#x8BF7;&#x6C42;&#xFF08;PR&#xFF09;&#x6570;&#x4F4E;&#x4EE3;&#x8868;&#x7684;&#x786E;&#x5207;&#x542B;&#x4E49;&#x3002;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x4E0D;&#x8BA4;&#x4E3A;&#x5BF9;&#x4E0D;&#x540C;&#x9879;&#x76EE;&#x7684;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x7EDD;&#x5BF9;&#x503C;&#x7684;&#x6BD4;&#x8F83;&#x6709;&#x592A;&#x591A;&#x7684;&#x79D1;&#x5B66;&#x610F;&#x4E49;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x672C;&#x8EAB;&#x7684;&#x6D3B;&#x8DC3;&#x5EA6;&#x53D8;&#x5316;&#x7684;&#x8D8B;&#x52BF;&#x548C;&#x5E45;&#x5EA6;&#xFF0C;&#x4F1A;&#x66F4;&#x6709;&#x9879;&#x76EE;&#x95F4;&#x6BD4;&#x8F83;&#x7684;&#x610F;&#x4E49;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4EE5;&#x4E09;&#x7EF4;&#x7A7A;&#x95F4;&#x6765;&#x63CF;&#x8FF0;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x6D3B;&#x8DC3;&#x5EA6;&#xFF0C;&#x4EE5;&#x63D0;&#x4EA4;&#x6570;&#x3001;&#x62C9;&#x53D6;&#x8BF7;&#x6C42;&#x6570;&#x3001;&#x8D21;&#x732E;&#x8005;&#x6570;&#x4E3A;&#x4E09;&#x7EF4;&#xFF0C;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x5728;&#x67D0;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#x67D0;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x5750;&#x6807;&#xFF0C;&#x90A3;&#x4E48;&#x8BA1;&#x7B97;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#xFF0C;&#x8BE5;&#x5750;&#x6807;&#x70B9;&#x7684;&#x79FB;&#x52A8;&#x8F68;&#x8FF9;&#x548C;&#x901F;&#x7387;&#xFF0C;&#x53EF;&#x4EE5;&#x771F;&#x5B9E;&#x7684;&#x53CD;&#x6620;&#x8BE5;&#x9879;&#x76EE;&#x7684;&#x6D3B;&#x8DC3;&#x5EA6;&#x8D8B;&#x52BF;&#x3002;</p>
<p>&#x8003;&#x8651;&#x5230;&#x6309;&#x5468;&#x5DE5;&#x4F5C;&#x7684;&#x4F5C;&#x606F;&#x65F6;&#x95F4;&#x7684;&#x666E;&#x904D;&#x5F71;&#x54CD;&#xFF0C;&#x6211;&#x4EEC;&#x4EE5;&#x4E00;&#x4E2A;&#x5DE5;&#x4F5C;&#x5468;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x91C7;&#x6837;&#x70B9;&#xFF0C;&#x7136;&#x540E;&#x8BA1;&#x7B97;&#x8FDE;&#x7EED;&#x7684;&#x51E0;&#x5468;&#x5185;&#x8BE5;&#x5750;&#x6807;&#x7684;&#x79FB;&#x52A8;&#x901F;&#x7387;&#x3002;&#x8FD9;&#x53CD;&#x6620;&#x4E86;&#x8BE5;&#x9879;&#x76EE;&#x7684;&#x53D1;&#x5C55;&#x901F;&#x5EA6;&#x3002;</p>
<p><strong>&#x793E;&#x533A;&#x5316;&#x7A0B;&#x5EA6;</strong></p>
<p>&#x5F00;&#x6E90;&#x8BDE;&#x751F;&#x4E8E;&#x793E;&#x533A;&#xFF0C;&#x7E41;&#x8363;&#x4E8E;&#x793E;&#x533A;&#xFF0C;&#x6839;&#x690D;&#x4E8E;&#x793E;&#x533A;&#xFF0C;&#x867D;&#x7136;&#x73B0;&#x5728;&#x5927;&#x578B;&#x7EC4;&#x7EC7;&#x3001;&#x5546;&#x4E1A;&#x516C;&#x53F8;&#x4E5F;&#x7EB7;&#x7EB7;&#x6295;&#x8EAB;&#x4E8E;&#x5F00;&#x6E90;&#x751F;&#x6001;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#xFF0C;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x751F;&#x547D;&#x529B;&#x4ECD;&#x7136;&#x5728;&#x4E8E;&#x793E;&#x533A;&#x3002;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x5426;&#x8BA4;&#x673A;&#x6784;&#x3001;&#x5546;&#x4E1A;&#x516C;&#x53F8;&#x5BF9;&#x5F00;&#x6E90;&#x7684;&#x5DE8;&#x5927;&#x8D21;&#x732E;&#x548C;&#x5F71;&#x54CD;&#x529B;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x53D8;&#x6210;&#x4E86;&#x4E00;&#x5BB6;&#x6216;&#x51E0;&#x5BB6;&#x5927;&#x4F01;&#x4E1A;&#x7684;&#x79C1;&#x4EBA;&#x6E38;&#x620F;&#xFF0C;&#x5176;&#x5FC5;&#x7136;&#x5931;&#x53BB;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x751F;&#x547D;&#x529B;&#xFF0C;&#x5B83;&#x6216;&#x8BB8;&#x4F1A;&#x5728;&#x5546;&#x4E1A;&#x4E0A;&#x53D6;&#x5F97;&#x6210;&#x529F;&#xFF0C;&#x4F46;&#x662F;&#x90A3;&#x4E2A;&#x6210;&#x529F;&#x4E0D;&#x662F;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x6210;&#x529F;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x9700;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x8BC4;&#x4F30;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x793E;&#x533A;&#x5316;&#xFF08;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#xFF09;&#x7A0B;&#x5EA6;&#x7684;&#x6307;&#x6807;&#x3002;&#x9879;&#x76EE;&#xFF08;&#x5C24;&#x5176;&#x662F;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#xFF09;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x5C5E;&#x6027;&#x662F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x793E;&#x533A;&#x5316;&#x8EAB;&#x4EFD;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x4EE5;&#x5B9E;&#x9645;&#x5411;&#x9879;&#x76EE;&#x8D21;&#x732E;&#x4E86;&#x4EE3;&#x7801;&#x7684;&#x4EBA;&#x5458;&#x7684;&#x793E;&#x533A;&#x5316;&#x79BB;&#x6563;&#x7A0B;&#x5EA6;&#x6765;&#x8BC4;&#x4F30;&#x9879;&#x76EE;&#x7684;&#x793E;&#x533A;&#x5316;&#x7A0B;&#x5EA6;&#x3002;</p>
<p>&#x6BCF;&#x4E2A;&#x53C2;&#x4E0E;&#x9879;&#x76EE;&#x5F00;&#x53D1;&#x7684;&#x4EBA;&#x5458;&#x5747;&#x6709;&#x5176;&#x8EAB;&#x4EFD;&#x5C5E;&#x6027;&#xFF0C;&#x8FD9;&#x4E2A;&#x8EAB;&#x4EFD;&#x53EF;&#x80FD;&#x662F;&#x4F01;&#x4E1A;&#x96C7;&#x4F63;&#x8EAB;&#x4EFD;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x793E;&#x533A;&#x5FD7;&#x613F;&#x8005;&#x8EAB;&#x4EFD;&#x3002;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x5BF9;&#x9879;&#x76EE;&#x7684;&#x63D0;&#x4EA4;&#x4E2D;&#x7684;&#x63D0;&#x4EA4;&#x8005;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x6536;&#x96C6;&#xFF0C;&#x7136;&#x540E;&#x6839;&#x636E;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x8EAB;&#x4EFD;&#x4FE1;&#x606F;&#x3001;&#x90AE;&#x4EF6;&#x540E;&#x7F00;&#x7B49;&#x4F9D;&#x4F18;&#x5148;&#x7EA7;&#x6765;&#x5224;&#x65AD;&#x5176;&#x6240;&#x5C5E;&#x8EAB;&#x4EFD;&#x3002;&#x7136;&#x540E;&#x5BF9;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x8FDB;&#x884C;&#x805A;&#x7C7B;&#xFF0C;&#x4EE5;&#x4E00;&#x4E2A;&#x79BB;&#x6563;&#x8BC4;&#x4F30;&#x6A21;&#x578B;&#x6765;&#x8BC4;&#x4F30;&#x8BE5;&#x6570;&#x636E;&#x96C6;&#x7684;&#x79BB;&#x6563;&#x7A0B;&#x5EA6;&#x3002;</p>
<p>&#x867D;&#x7136;&#x9879;&#x76EE;&#x8D8A;&#x4E2D;&#x5FC3;&#x5316;&#xFF0C;&#x5176;&#x53D1;&#x5C55;&#x98CE;&#x9669;&#x8D8A;&#x9AD8;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x793E;&#x533A;&#x5316;&#x7A0B;&#x5EA6;&#x8D8A;&#x9AD8;&#x7684;&#x9879;&#x76EE;&#x5C31;&#x8D8A;&#x5065;&#x5EB7;&#xFF0C;&#x8FC7;&#x4E8E;&#x79BB;&#x6563;&#x7684;&#x9879;&#x76EE;&#x4E5F;&#x5BB9;&#x6613;&#x51FA;&#x73B0;&#x9879;&#x76EE;&#x5206;&#x88C2;&#x3001;&#x8FED;&#x4EE3;&#x7F13;&#x6162;&#x7B49;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x663E;&#x7136;&#x662F;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x9002;&#x5F53;&#x7684;&#x533A;&#x57DF;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x4E0A;&#x8FF0;&#x4E24;&#x4E2A;&#x6307;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5BF9;&#x9879;&#x76EE;&#x8FDB;&#x884C;&#x8C61;&#x9650;&#x5212;&#x5206;&#xFF0C;&#x4EE5;&#x201C;&#x9879;&#x76EE;&#x6D3B;&#x8DC3;&#x5EA6;&#x201D;&#x548C;&#x201C;&#x793E;&#x533A;&#x5316;&#x7A0B;&#x5EA6;&#x201D;&#x4E3A;&#x4E24;&#x4E2A;&#x8C61;&#x9650;&#x8F74;&#x3002;</p>
<p><strong>Grank &#x9879;&#x76EE;</strong></p>
<p>&#x6839;&#x636E;&#x5982;&#x4E0A;&#x7684;&#x65B9;&#x6CD5;&#x8BBA;&#xFF0C;&#x6211;&#x4EEC;&#xFF08;Linux &#x4E2D;&#x56FD;&#xFF09;&#x53D1;&#x8D77;&#x4E86;&#x4E00;&#x4E2A;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#xFF0C;&#x7528;&#x4E8E;&#x63D0;&#x4F9B;&#x5206;&#x6790;&#x5DE5;&#x5177;&#xFF0C;&#x8BE5;&#x5DE5;&#x5177;&#x7531; Linux &#x4E2D;&#x56FD;&#x6838;&#x5FC3;&#x6210;&#x5458; Bestony &#x521B;&#x5EFA;&#xFF0C;&#x5E76;&#x8D21;&#x732E;&#x7ED9;&#x793E;&#x533A;&#xFF0C;&#x4EE5;&#x671F;&#x8FDB;&#x4E00;&#x6B65;&#x5B8C;&#x5584;&#x3002;</p>
<blockquote>
<p>&#x9879;&#x76EE;&#x5730;&#x5740;&#xFF1A; <a href="https://github.com/LCTT/Grank" target="_blank">https://github.com/LCTT/Grank</a></p>
</blockquote>
<p><strong>&#x6570;&#x636E;&#x91C7;&#x96C6;&#x65B9;&#x6CD5;</strong></p>
<p>&#x6211;&#x4EEC;&#x91C7;&#x7528; GitHub &#x63D0;&#x4F9B;&#x7684; API &#x8FDB;&#x884C;&#x6570;&#x636E;&#x91C7;&#x96C6;&#xFF0C;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x8303;&#x56F4;&#x4E3A;&#x56FD;&#x5185;&#x4E3B;&#x8981;&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#x5728; GitHub &#x4E0A;&#x7684;&#x91CD;&#x8981;&#xFF08;&#x6D3B;&#x8DC3;&#xFF09;&#x9879;&#x76EE;&#xFF08;&#x4EE5;&#x4E0B;&#x5217;&#x8868;&#x6392;&#x540D;&#x4E0D;&#x5206;&#x5148;&#x540E;&#xFF09;&#xFF1A;</p>
<ul>
<li>&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#xFF08;Ant Design&#x3001;&#x8682;&#x8681;&#x91D1;&#x670D;&#x3001;Angular Developers&#x3001;&#x6DD8;&#x5B9D;&#x3001;&#x5929;&#x732B;&#x524D;&#x7AEF;&#x3001;eggjs&#xFF09;</li>
<li>&#x534E;&#x4E3A;&#xFF08;&#x534E;&#x4E3A; Hadoop&#xFF09;</li>
<li>&#x817E;&#x8BAF;&#xFF08;AlloyTeam&#x3001;tarscloud&#xFF09;</li>
<li>&#x767E;&#x5EA6;&#xFF08;FEX&#x3001;EFE&#x3001;&#x524D;&#x7AEF;&#xFF09;</li>
<li>&#x997F;&#x4E86;&#x4E48;&#xFF08;&#x524D;&#x7AEF;&#xFF09;</li>
<li>&#x7F51;&#x6613;</li>
<li>&#x641C;&#x72D0;</li>
<li>&#x5947;&#x864E; 360&#xFF08;360 &#x4F01;&#x4E1A;&#x5B89;&#x5168;&#xFF09;</li>
<li>&#x552F;&#x54C1;&#x4F1A;</li>
<li>&#x8C46;&#x74E3;</li>
<li>&#x5927;&#x4F17;&#x70B9;&#x8BC4;</li>
<li>&#x5C0F;&#x7C73;</li>
<li>&#x7F8E;&#x56E2;&#xFF08;&#x7F8E;&#x56E2;&#x70B9;&#x8BC4;&#xFF09;</li>
<li>&#x7F8E;&#x4E3D;</li>
<li>&#x8C4C;&#x8C46;&#x835A;</li>
<li>&#x5F53;&#x5F53;</li>
<li>&#x6709;&#x8D5E;</li>
<li>&#x6DF1;&#x5EA6;</li>
<li>DNSPod</li>
<li>&#x65B0;&#x6D6A;&#x5FAE;&#x535A;</li>
<li>&#x4ECA;&#x65E5;&#x5934;&#x6761;</li>
<li>&#x6EF4;&#x6EF4;&#x51FA;&#x884C;</li>
<li>eBay</li>
</ul>
<p>&#x4EE5;&#x53CA;&#x5404;&#x4E2A;&#x516C;&#x53F8;&#x6350;&#x732E;&#x7ED9; Apache &#x57FA;&#x91D1;&#x4F1A;&#x7684;&#x9879;&#x76EE;&#xFF1A;</p>
<ul>
<li>Apache carbondata&#xFF08;&#x534E;&#x4E3A;&#xFF09;</li>
<li>Apache eagle&#xFF08;eBay&#xFF09;</li>
<li>Apache kylin&#xFF08;eBay&#xFF09;</li>
<li>Apache hawq&#xFF08;Pivotal&#xFF09;</li>
<li>Apache rocketmq&#xFF08;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#xFF09;</li>
<li>incubator-dubbo&#xFF08;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#xFF09;</li>
<li>incubator-weex&#xFF08;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#xFF09;</li>
<li>incubator-doris&#xFF08;&#x767E;&#x5EA6;&#xFF09;</li>
<li>incubator-echarts&#xFF08;&#x767E;&#x5EA6;&#xFF09;</li>
<li>incubator-griffin&#xFF08;eBay&#xFF09;</li>
<li>incubator-skywalking&#xFF08;&#x4E2A;&#x4EBA;&#xFF09;</li>
</ul>
<p>&#x6839;&#x636E;&#x5BF9;&#x4E0A;&#x8FF0;&#x7EC4;&#x7EC7;&#x7684;&#x8FD1; 500 &#x4E2A;&#x9879;&#x76EE;&#x7684;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x548C;&#x5206;&#x6790;&#xFF0C;&#x6211;&#x4EEC;&#x5F97;&#x51FA;&#x4E86;&#x5982;&#x4E0B;&#x7ED3;&#x679C;&#x3002;</p>
<p><strong>&#x6570;&#x636E;&#x7ED3;&#x679C;&#x70B9;&#x8BC4;</strong></p>
<p>&#x901A;&#x8FC7;&#x5BF9;&#x4E0A;&#x8FF0;&#x9879;&#x76EE;&#x4ECE; 2017/10/1 &#x81F3; 2018/9/30 &#x6B62;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5206;&#x6790;&#xFF0C;&#x5176;&#x6D3B;&#x8DC3;&#x5EA6;&#x6307;&#x6807;&#x6570;&#x636E;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><img src="https://postimg.aliavv.com/mbp/knbpc.jpg" alt=""></p>
<p>&#x5176;&#x4E2D;&#x524D;&#x4E94;&#x540D;&#x7684;&#x6D3B;&#x8DC3;&#x5EA6;&#x53D8;&#x5316;&#x8D8B;&#x52BF;&#x4E3A;&#xFF1A;</p>
<p><img src="https://postimg.aliavv.com/mbp/a6bol.jpg" alt=""></p>
<p>&#x5176;&#x4E2D;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x963F;&#x91CC;&#x7CFB;&#x9879;&#x76EE;&#x72EC;&#x5360;&#x9CCC;&#x5934;&#xFF0C;&#x800C;&#x8FD9;&#x4E94;&#x4E2A;&#x9879;&#x76EE;&#x4E2D;&#x6709;&#x4E09;&#x4E2A;&#x662F;&#x524D;&#x7AEF;&#x9879;&#x76EE;&#x3002;</p>
<p>&#x8FD9;&#x4E94;&#x4E2A;&#x6700;&#x6D3B;&#x8DC3;&#x9879;&#x76EE;&#x7684;&#x793E;&#x533A;&#x5316;&#x8D8B;&#x52BF;&#x4E3A;&#xFF1A;</p>
<p><img src="https://postimg.aliavv.com/mbp/73jyl.jpg" alt=""></p>
<p>&#x53EF;&#x4EE5;&#x8BF4;&#xFF0C;&#x9664;&#x4E86;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x7684;&#x98DE;&#x51B0;&#xFF08;ice&#xFF09;&#x9879;&#x76EE;&#x5916;&#xFF0C;&#x5176;&#x5B83;&#x9879;&#x76EE;&#x7684;&#x793E;&#x533A;&#x53C2;&#x4E0E;&#x7A0B;&#x5EA6;&#x90FD;&#x5F88;&#x9AD8;&#x3002;</p>
<p>&#x5176;&#x4E2D;&#x524D;&#x4E94;&#x540D;&#x7684;&#x9879;&#x76EE;&#x7684;&#x5404;&#x81EA;&#x60C5;&#x51B5;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><strong>1. &#x8682;&#x8681;&#x91D1;&#x670D;&#x7684; ant-design &#x524D;&#x7AEF;&#x9879;&#x76EE;</strong></p>
<blockquote>
<p>&#x9879;&#x76EE;&#x5730;&#x5740;&#xFF1A; <a href="https://github.com/ant-design/ant-design" target="_blank">https://github.com/ant-design/ant-design</a></p>
</blockquote>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x201C;&#x670D;&#x52A1;&#x4E8E;&#x4F01;&#x4E1A;&#x7EA7;&#x4EA7;&#x54C1;&#x7684;&#x8BBE;&#x8BA1;&#x4F53;&#x7CFB;&#x201D;&#xFF0C;&#x662F;&#x7531;&#x8682;&#x8681;&#x91D1;&#x670D;&#x4F53;&#x9A8C;&#x6280;&#x672F;&#x90E8;&#x91C7;&#x7528; React &#x5C01;&#x88C5;&#x7684;&#x4E00;&#x5957;&#x7EC4;&#x4EF6;&#x5E93;&#x3002;</p>
<p><img src="https://postimg.aliavv.com/mbp/8y6kg.jpg" alt=""></p>
<p>&#x4ECE;&#x5176;&#x6700;&#x8FD1;&#x4E00;&#x5E74;&#x7684;&#x6D3B;&#x8DC3;&#x5EA6;&#x6570;&#x636E;&#xFF08;&#x7EA2;&#xFF09;&#x6765;&#x770B;&#xFF0C;&#x5176;&#x4E00;&#x5E74;&#x4E4B;&#x5185;&#x5C31;&#x6709; 2298 &#x4E2A;&#x63D0;&#x4EA4;&#xFF0C;&#x6700;&#x591A;&#x7684;&#x4E00;&#x5468;&#x6709; 122 &#x4E2A;&#x63D0;&#x4EA4;&#xFF1B;&#x800C;&#x5728;&#x8FD9;&#x4E00;&#x5E74;&#x5185;&#xFF0C;&#x65B0;&#x589E;&#x4E86; 350 &#x4F4D;&#x8D21;&#x732E;&#x8005;&#x548C; 1057 &#x4E2A; PR&#x3002;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x4E00;&#x4E2A;&#x6D3B;&#x8DC3;&#x5EA6;&#x975E;&#x5E38;&#x9AD8;&#x7684;&#x524D;&#x7AEF;&#x9879;&#x76EE;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x4ECE;&#x8D8B;&#x52BF;&#x4E0A;&#xFF0C;&#x5176;&#x8FD1;&#x671F;&#x7684;&#x6D3B;&#x8DC3;&#x5EA6;&#x8D8B;&#x52BF;&#x8FD8;&#x5728;&#x589E;&#x52A0;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#xFF0C;&#x4ECE;&#x5176;&#x793E;&#x533A;&#x5316;&#x6307;&#x6570;&#xFF08;&#x84DD;&#xFF09;&#x4E0A;&#x770B;&#xFF0C;&#x5176;&#x793E;&#x533A;&#x53C2;&#x4E0E;&#x6BD4;&#x4F8B;&#x5728;&#x8FD1;&#x671F;&#x7565;&#x6709;&#x4E0B;&#x964D;&#xFF0C;&#x4F46;&#x662F;&#x6574;&#x4F53;&#x6765;&#x8BF4;&#xFF0C;&#x4F9D;&#x65E7;&#x7EF4;&#x6301;&#x8F83;&#x9AD8;&#x6C34;&#x5E73;&#xFF08;95% &#x4EE5;&#x4E0A;&#xFF09;&#x3002;</p>
<p><strong>2. &#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x7684; pouch &#x5BB9;&#x5668;&#x5F15;&#x64CE;</strong></p>
<blockquote>
<p>&#x9879;&#x76EE;&#x5730;&#x5740;&#xFF1A;<a href="https://github.com/alibaba/pouch" target="_blank">https://github.com/alibaba/pouch</a></p>
</blockquote>
<p>&#x8FD9;&#x662F;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x5728;&#x4E91;&#x8BA1;&#x7B97;&#x65B9;&#x9762;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x5927;&#x9879;&#x76EE;&#xFF0C;&#x5176;&#x5BF9;&#x4E8E;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x96C6;&#x56E2;&#x5185;&#x90E8;&#x7684;&#x5BB9;&#x5668;&#x5316;&#x8FDB;&#x7A0B;&#x8D77;&#x5230;&#x4E86;&#x6781;&#x5927;&#x7684;&#x63A8;&#x52A8;&#x3002;</p>
<p><img src="https://postimg.aliavv.com/mbp/5kvta.jpg" alt=""></p>
<p>&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x8FC4;&#x4ECA;&#x4E5F;&#x53EA;&#x6709;&#x4E00;&#x5E74;&#x7684;&#x53D1;&#x5C55;&#x5386;&#x7A0B;&#xFF0C;&#x4F46;&#x662F;&#x5176;&#x6D3B;&#x8DC3;&#x5EA6;&#x4ECE;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x9AD8;&#x5C45;&#x4E0D;&#x4E0B;&#xFF0C;&#x751A;&#x81F3;&#x5728; 2018 &#x5E74; 8 &#x6708;&#x6709;&#x4E2A;&#x663E;&#x8457;&#x7684;&#x6D3B;&#x8DC3;&#x9AD8;&#x5CF0;&#x3002;&#x867D;&#x7136;&#x5176;&#x4E00;&#x5E74;&#x6765;&#x53EA;&#x6709;&#x51E0;&#x5341;&#x4F4D;&#x505A;&#x51FA;&#x63D0;&#x4EA4;&#x7684;&#x8D21;&#x732E;&#x8005;&#xFF0C;&#x4F46;&#x662F;&#x6BCF;&#x5468;&#x7684;&#x63D0;&#x4EA4;&#x6570;&#x91CF;&#x3001;PR &#x6570;&#x91CF;&#x90FD;&#x5F88;&#x7A33;&#x5B9A;&#xFF0C;&#x8BF4;&#x660E;&#x9879;&#x76EE;&#x7684;&#x53D1;&#x5C55;&#x5F88;&#x5065;&#x5EB7;&#x3002;</p>
<p>&#x6BD4;&#x8F83;&#x6709;&#x610F;&#x601D;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x793E;&#x533A;&#x5316;&#x7A0B;&#x5EA6;&#x6BD4;&#x8F83;&#x9AD8;&#xFF0C;&#x4E5F;&#x6BD4;&#x8F83;&#x7A33;&#x5B9A;&#xFF0C;&#x4ECE;&#x5176;&#x5B98;&#x7F51;&#x548C; GitHub &#x4E3B;&#x9875;&#x4E0A;&#x7684;&#x6587;&#x6863;&#x548C;&#x8BF4;&#x660E;&#x5168;&#x662F;&#x82F1;&#x6587;&#x6765;&#x770B;&#xFF0C;&#x5176;&#x56FD;&#x9645;&#x5316;&#x63A8;&#x5E7F;&#x7684;&#x7A0B;&#x5EA6;&#x6BD4;&#x8F83;&#x9AD8;&#x3002;</p>
<p><strong>3. &#x534E;&#x4E3A;&#x6350;&#x732E;&#x7ED9; Apache &#x57FA;&#x91D1;&#x4F1A;&#x7684; CarbonData &#x9879;&#x76EE;</strong></p>
<blockquote>
<p>&#x9879;&#x76EE;&#x5730;&#x5740;&#xFF1A;<a href="https://github.com/apache/CarbonData" target="_blank">https://github.com/apache/CarbonData</a></p>
</blockquote>
<p>Apache CarbonData &#x9879;&#x76EE;&#x662F;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x5217;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x65B9;&#x6848;&#xFF0C;&#x53EF;&#x7528;&#x4E8E;&#x5927;&#x6570;&#x636E;&#x5E73;&#x53F0;&#xFF08;&#x5982; Apache Hadoop&#x3001; Apache Spark&#xFF09;&#x7684;&#x5FEB;&#x901F;&#x5206;&#x6790;&#x3002;</p>
<p><img src="https://postimg.aliavv.com/mbp/2xhsl.jpg" alt=""></p>
<p>&#x5176;&#x9879;&#x76EE;&#x7684;&#x6D3B;&#x8DC3;&#x5EA6;&#x76F8;&#x5F53;&#x53EF;&#x89C2;&#xFF0C;&#x793E;&#x533A;&#x5316;&#x7A0B;&#x5EA6;&#x4E5F;&#x80FD;&#x7A33;&#x5B9A;&#x5728;&#x5F88;&#x9AD8;&#x7684;&#x7A0B;&#x5EA6;&#x4E0A;&#x3002;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x662F;&#x552F;&#x4E00;&#x8FDB;&#x5165;&#x524D;&#x4E94;&#x7684; Apache &#x57FA;&#x91D1;&#x4F1A;&#x7BA1;&#x7406;&#x9879;&#x76EE;&#xFF0C;&#x4E5F;&#x662F;&#x534E;&#x4E3A;&#x6240;&#x6709;&#x9879;&#x76EE;&#x4E2D;&#x6D3B;&#x8DC3;&#x5EA6;&#x6700;&#x9AD8;&#x7684;&#x9879;&#x76EE;&#x3002;</p>
<p><strong>4. &#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x7684;&#x98DE;&#x51B0;&#x524D;&#x7AEF;&#x9879;&#x76EE;</strong></p>
<blockquote>
<p>&#x9879;&#x76EE;&#x5730;&#x5740;&#xFF1A; <a href="https://github.com/alibaba/ice" target="_blank">https://github.com/alibaba/ice</a></p>
</blockquote>
<p>&#x8FD9;&#x53C8;&#x662F;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x7684;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#xFF0C;&#x540C;&#x6837;&#x662F;&#x524D;&#x7AEF;&#x9879;&#x76EE;&#xFF0C;&#x5176;&#x201C;&#x6D77;&#x91CF;&#x53EF;&#x590D;&#x7528;&#x7269;&#x6599;&#xFF0C;&#x914D;&#x5957;&#x684C;&#x9762;&#x5DE5;&#x5177;&#x6781;&#x901F;&#x6784;&#x5EFA;&#x524D;&#x7AEF;&#x5E94;&#x7528;&#x201D;&#x3002;</p>
<p><img src="https://postimg.aliavv.com/mbp/hnz1z.jpg" alt=""></p>
<p>&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x51FA;&#x73B0;&#x4E5F;&#x4E0D;&#x4E45;&#xFF0C;&#x8FD8;&#x4E0D;&#x5230;&#x4E00;&#x5E74;&#xFF0C;&#x5176;&#x6D3B;&#x8DC3;&#x5EA6;&#x4E5F;&#x76F8;&#x5F53;&#x53EF;&#x89C2;&#xFF0C;&#x4F46;&#x662F;&#x540C;&#x6837;&#xFF0C;&#x968F;&#x7740;&#x9879;&#x76EE;&#x7684;&#x6210;&#x719F;&#xFF0C;&#x5176;&#x793E;&#x533A;&#x53C2;&#x4E0E;&#x5EA6;&#x4E5F;&#x4E00;&#x8DEF;&#x8D70;&#x4F4E;&#x6781;&#x4F4E;&#x6C34;&#x5E73;&#x3002;</p>
<p><strong>5. &#x997F;&#x4E86;&#x4E48;&#x7684;&#x524D;&#x7AEF;&#x9879;&#x76EE; element</strong></p>
<p>&#x9879;&#x76EE;&#x5730;&#x5740;&#xFF1A;<a href="https://github.com/elemefe/element" target="_blank">https://github.com/elemefe/element</a></p>
<p>&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x662F;&#x997F;&#x4E86;&#x4E48;&#x524D;&#x7AEF;&#x90E8;&#x95E8;&#x201C;&#x4E3A;&#x5F00;&#x53D1;&#x8005;&#x3001;&#x8BBE;&#x8BA1;&#x5E08;&#x548C;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x51C6;&#x5907;&#x7684;&#x57FA;&#x4E8E; Vue 2.0 &#x7684;&#x684C;&#x9762;&#x7AEF;&#x7EC4;&#x4EF6;&#x5E93;&#x201D;&#x3002;</p>
<p><img src="https://postimg.aliavv.com/mbp/zctl3.jpg" alt=""></p>
<p>&#x4ECE;&#x8BE5;&#x9879;&#x76EE;&#x7684;&#x6D3B;&#x8DC3;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x6CE2;&#x52A8;&#x6BD4;&#x8F83;&#x5927;&#xFF0C;&#x4E14;&#x8FD1;&#x671F;&#x6709;&#x6D3B;&#x8DC3;&#x5EA6;&#x51CF;&#x4F4E;&#x7684;&#x8D8B;&#x52BF;&#x3002;&#x800C;&#x793E;&#x533A;&#x5316;&#x7A0B;&#x5EA6;&#x5219;&#x4FDD;&#x6301;&#x8F83;&#x9AD8;&#x7684;&#x7A0B;&#x5EA6;&#x3002;</p>
<p>&#x5728;&#x524D;&#x4E94;&#x4E4B;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x989D;&#x5916;&#x5BF9;&#x7B2C; 6 &#x540D; Apache &#x5B75;&#x5316;&#x9879;&#x76EE; skywalking &#x505A;&#x4E00;&#x4E2A;&#x8BF4;&#x660E;&#xFF1A;</p>
<p><strong>6. &#x4E2A;&#x4EBA;&#x4E3B;&#x5BFC;&#x7684; Apache &#x5B75;&#x5316;&#x9879;&#x76EE; skywalking</strong></p>
<blockquote>
<p>&#x9879;&#x76EE;&#x5730;&#x5740;&#xFF1A;</p>
<p><a href="https://github.com/apache/incubator-skywalking" target="_blank">https://github.com/apache/incubator-skywalking</a></p>
</blockquote>
<p>&#x8FD9;&#x662F;&#x56FD;&#x5185;&#x552F;&#x4E00;&#x8FDB;&#x5165; Apache &#x57FA;&#x91D1;&#x4F1A;&#x7684;&#x7531;&#x4E2A;&#x4EBA;&#x4E3B;&#x5BFC;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x3002;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x8DDF;&#x8E2A;&#x7CFB;&#x7EDF;&#x548C;&#x5E94;&#x7528;&#x76D1;&#x6D4B;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x5FAE;&#x670D;&#x52A1;&#x3001;&#x5BB9;&#x5668;&#x73AF;&#x5883;&#x7684;&#x76D1;&#x6D4B;&#x3002;</p>
<p><img src="https://postimg.aliavv.com/mbp/6rhgq.jpg" alt=""></p>
<p>&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x7531;&#x4E2A;&#x4EBA;&#x4E3B;&#x5BFC;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x6D3B;&#x8DC3;&#x4E8E;&#x4E91;&#x539F;&#x751F;&#x9886;&#x57DF;&#x7684;&#xFF0C;&#x80FD;&#x53D6;&#x5F97;&#x8FD9;&#x6837;&#x9AD8;&#x7684;&#x9879;&#x76EE;&#x6D3B;&#x8DC3;&#x5EA6;&#x5341;&#x5206;&#x4E0D;&#x6613;&#x3002;</p>
<p><strong>&#x5C0F;&#x7ED3;</strong></p>
<p>&#x4ECE;&#x4E0A;&#x8FF0;&#x8868;&#x683C;&#x6570;&#x636E;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;/&#x8682;&#x8681;&#x91D1;&#x670D;&#x5728;&#x5F00;&#x6E90;&#x65B9;&#x9762;&#x6D3B;&#x8DC3;&#x5EA6;&#x5F88;&#x9AD8;&#xFF08;&#x524D; 50 &#x540D;&#x4E2D;&#xFF0C;&#x8D85;&#x8FC7;&#x4E86;&#x4E00;&#x534A;&#xFF09;&#x3002;&#x4ECE;&#x4E0B;&#x56FE;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x6765;&#xFF0C;&#x5176;&#x6574;&#x4F53;&#x7684;&#x6D3B;&#x8DC3;&#x5EA6;&#x548C;&#x793E;&#x533A;&#x5316;&#x7A0B;&#x5EA6;&#x90FD;&#x4E0D;&#x9519;&#x3002;</p>
<p><img src="https://postimg.aliavv.com/mbp/k44e6.jpg" alt=""></p>
<p><img src="https://postimg.aliavv.com/mbp/oi84n.jpg" alt=""></p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x9664;&#x4E86;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x3001;&#x817E;&#x8BAF;&#x3001;&#x767E;&#x5EA6;&#x3001;&#x534E;&#x4E3A;&#x4E4B;&#x5916;&#xFF0C;&#x6709;&#x8D5E;&#x3001;&#x997F;&#x4E86;&#x4E48;&#x3001;&#x552F;&#x54C1;&#x4F1A;&#x4E5F;&#x6709;&#x51E0;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x6D3B;&#x8DC3;&#x5EA6;&#x5F88;&#x9AD8;&#xFF0C;&#x53EF;&#x89C1;&#x73B0;&#x5728;&#x6CE8;&#x91CD;&#x5F00;&#x6E90;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x4F01;&#x4E1A;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x4E86;&#x3002;</p>
<p>&#x800C;&#x5728;&#x4E0A;&#x699C;&#x7684;&#x9879;&#x76EE;&#x5F53;&#x4E2D;&#xFF0C;&#x524D;&#x7AEF;&#x9879;&#x76EE;&#x5360;&#x636E;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x4E0E;&#x8FD9;&#x79CD;&#x9879;&#x76EE;&#x7684;&#x8FED;&#x4EE3;&#x901F;&#x5EA6;&#x8F83;&#x5FEB;&#x6709;&#x5173;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2018 GRank 报告","level":"1.1","depth":1,"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"README.md","mtime":"2020-01-06T01:52:36.758Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-01-06T01:52:44.859Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

