
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>附录一、研究方法综述 · Grank 2019 年度分析报告</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Grank">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="crawler.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://linux.cn" target="_blank" class="custom-link">Linux.CN</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../insight.html">
            
                <a href="../insight.html">
            
                    
                    洞察
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../data.html">
            
                <a href="../data.html">
            
                    
                    数据
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    附录
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.4.1" data-path="theory.html">
            
                <a href="theory.html">
            
                    
                    附录一、研究方法综述
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="crawler.html">
            
                <a href="crawler.html">
            
                    
                    附录二、数据采集综述
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="accounts.html">
            
                <a href="accounts.html">
            
                    
                    附录三、参与分析账号
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="contact.html">
            
                <a href="contact.html">
            
                    
                    附录四、反馈报告问题
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" data-path="all_data.html">
            
                <a href="all_data.html">
            
                    
                    附录五、所有数据
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../thanks.html">
            
                <a href="../thanks.html">
            
                    
                    致谢
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >附录一、研究方法综述</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x9644;&#x5F55;&#x4E00;-&#x7814;&#x7A76;&#x65B9;&#x6CD5;&#x7EFC;&#x8FF0;">&#x9644;&#x5F55;&#x4E00; &#x7814;&#x7A76;&#x65B9;&#x6CD5;&#x7EFC;&#x8FF0;</h1>
<p>Grank &#x662F;&#x672C;&#x62A5;&#x544A;&#x5236;&#x5B9A;&#x7684;&#x4E00;&#x4E2A;&#x6307;&#x6570;&#xFF0C;&#x7528;&#x4E8E;&#x7EFC;&#x5408;&#x8BC4;&#x4F30;&#x4E00;&#x4E2A;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x3001;&#x5F00;&#x6E90;&#x7EC4;&#x7EC7;&#x7684;&#x5065;&#x5EB7;&#x7A0B;&#x5EA6;&#x3002;</p>
<p><strong>Grank &#x6A21;&#x578B;&#x4ECB;&#x7ECD;</strong></p>
<p>&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#xFF0C;&#x4E00;&#x4E2A;&#x5065;&#x5EB7;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x5E94;&#x8BE5;&#x4F53;&#x73B0;&#x4E3A;&#x4EE5;&#x4E0B;&#x4E24;&#x4E2A;&#x65B9;&#x9762;&#xFF1A;</p>
<ul>
<li><p>&#x9879;&#x76EE;&#x7684;&#x6D3B;&#x8DC3;&#x5EA6;&#x8D8B;&#x52BF;</p>
</li>
<li><p>&#x9879;&#x76EE;&#x7684;&#x793E;&#x533A;&#x5316;&#xFF08;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#xFF09;&#x7A0B;&#x5EA6;</p>
</li>
</ul>
<p>&#x800C;&#x8FD9;&#x4E24;&#x4E2A;&#x65B9;&#x9762;&#x5206;&#x522B;&#x6709;&#x591A;&#x4E2A;&#x56E0;&#x7D20;&#x7EC4;&#x6210;&#xFF1A;</p>
<p><strong>&#x6D3B;&#x8DC3;&#x5EA6;&#x548C;&#x6D3B;&#x8DC3;&#x5EA6;&#x8D8B;&#x52BF;</strong></p>
<p>&#x9879;&#x76EE;&#x7684;&#x6D3B;&#x8DC3;&#x5EA6;&#xFF0C;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x4E3A;&#x9879;&#x76EE;&#x7684;&#x63D0;&#x4EA4;&#x6570;&#x3001; &#x62C9;&#x53D6;&#x8BF7;&#x6C42;&#x6570;&#x548C;&#x8D21;&#x732E;&#x8005;&#x6570;&#xFF08;&#x5176;&#x5B83;&#x6570;&#x636E;&#xFF0C;&#x5982;&#x4EE3;&#x7801;&#x884C;&#x6570;&#x3001;&#x6587;&#x4EF6;&#x6570;&#x3001;issue &#x6570;&#x3001; fork &#x6570;&#x3001;star &#x6570;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x6743;&#x91CD;&#x76F8;&#x5BF9;&#x4F4E;&#x5F97;&#x591A;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x4EE3;&#x8868;&#x610F;&#x4E49;&#x4E0D;&#x591F;&#x786E;&#x5B9A;&#xFF0C;&#x6B64;&#x5904;&#x5FFD;&#x7565;&#x4E0D;&#x8BA1;&#x5165;&#x6A21;&#x578B;&#xFF09;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x5176;&#x6A2A;&#x5411;&#x6BD4;&#x8F83;&#x5176;&#x6D3B;&#x8DC3;&#x5EA6;&#xFF0C;&#x6216;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x6D3B;&#x8DC3;&#x5EA6;&#x5F62;&#x6001;&#xFF0C;&#x6216;&#x4E0D;&#x5177;&#x5907;&#x53EF;&#x6BD4;&#x6027;&#x3002;&#x5F88;&#x96BE;&#x8BF4;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x6BD4;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x63D0;&#x4EA4;&#x6570;&#x9AD8;&#xFF0C;&#x800C;&#x62C9;&#x53D6;&#x8BF7;&#x6C42;&#xFF08;PR&#xFF09;&#x6570;&#x4F4E;&#x4EE3;&#x8868;&#x7684;&#x786E;&#x5207;&#x542B;&#x4E49;&#x3002;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x4E0D;&#x8BA4;&#x4E3A;&#x5BF9;&#x4E0D;&#x540C;&#x9879;&#x76EE;&#x7684;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x7EDD;&#x5BF9;&#x503C;&#x7684;&#x6BD4;&#x8F83;&#x6709;&#x592A;&#x591A;&#x7684;&#x79D1;&#x5B66;&#x610F;&#x4E49;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x672C;&#x8EAB;&#x7684;&#x6D3B;&#x8DC3;&#x5EA6;&#x53D8;&#x5316;&#x7684;&#x8D8B;&#x52BF;&#x548C;&#x5E45;&#x5EA6;&#xFF0C;&#x4F1A;&#x66F4;&#x6709;&#x9879;&#x76EE;&#x95F4;&#x6BD4;&#x8F83;&#x7684;&#x610F;&#x4E49;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4EE5;&#x4E09;&#x7EF4;&#x7A7A;&#x95F4;&#x6765;&#x63CF;&#x8FF0;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x6D3B;&#x8DC3;&#x5EA6;&#xFF0C;&#x4EE5;&#x63D0;&#x4EA4;&#x6570;&#x3001;&#x62C9;&#x53D6;&#x8BF7;&#x6C42;&#x6570;&#x3001;&#x8D21;&#x732E;&#x8005;&#x6570;&#x4E3A;&#x4E09;&#x7EF4;&#xFF0C;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x5728;&#x67D0;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#x67D0;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x5750;&#x6807;&#xFF0C;&#x90A3;&#x4E48;&#x8BA1;&#x7B97;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#xFF0C;&#x8BE5;&#x5750;&#x6807;&#x70B9;&#x7684;&#x79FB;&#x52A8;&#x8F68;&#x8FF9;&#x548C;&#x901F;&#x7387;&#xFF0C;&#x53EF;&#x4EE5;&#x771F;&#x5B9E;&#x7684;&#x53CD;&#x6620;&#x8BE5;&#x9879;&#x76EE;&#x7684;&#x6D3B;&#x8DC3;&#x5EA6;&#x8D8B;&#x52BF;&#x3002;</p>
<p>&#x8003;&#x8651;&#x5230;&#x6309;&#x5468;&#x5DE5;&#x4F5C;&#x7684;&#x4F5C;&#x606F;&#x65F6;&#x95F4;&#x7684;&#x666E;&#x904D;&#x5F71;&#x54CD;&#xFF0C;&#x6211;&#x4EEC;&#x4EE5;&#x4E00;&#x4E2A;&#x5DE5;&#x4F5C;&#x5468;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x91C7;&#x6837;&#x70B9;&#xFF0C;&#x7136;&#x540E;&#x8BA1;&#x7B97;&#x8FDE;&#x7EED;&#x7684;&#x51E0;&#x5468;&#x5185;&#x8BE5;&#x5750;&#x6807;&#x7684;&#x79FB;&#x52A8;&#x901F;&#x7387;&#x3002;&#x8FD9;&#x53CD;&#x6620;&#x4E86;&#x8BE5;&#x9879;&#x76EE;&#x7684;&#x53D1;&#x5C55;&#x901F;&#x5EA6;&#x3002;</p>
<p><strong>&#x793E;&#x533A;&#x5316;&#x7A0B;&#x5EA6;</strong></p>
<p>&#x5F00;&#x6E90;&#x8BDE;&#x751F;&#x4E8E;&#x793E;&#x533A;&#xFF0C;&#x7E41;&#x8363;&#x4E8E;&#x793E;&#x533A;&#xFF0C;&#x6839;&#x690D;&#x4E8E;&#x793E;&#x533A;&#xFF0C;&#x867D;&#x7136;&#x73B0;&#x5728;&#x5927;&#x578B;&#x7EC4;&#x7EC7;&#x3001;&#x5546;&#x4E1A;&#x516C;&#x53F8;&#x4E5F;&#x7EB7;&#x7EB7;&#x6295;&#x8EAB;&#x4E8E;&#x5F00;&#x6E90;&#x751F;&#x6001;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#xFF0C;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x751F;&#x547D;&#x529B;&#x4ECD;&#x7136;&#x5728;&#x4E8E;&#x793E;&#x533A;&#x3002;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x5426;&#x8BA4;&#x673A;&#x6784;&#x3001;&#x5546;&#x4E1A;&#x516C;&#x53F8;&#x5BF9;&#x5F00;&#x6E90;&#x7684;&#x5DE8;&#x5927;&#x8D21;&#x732E;&#x548C;&#x5F71;&#x54CD;&#x529B;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x53D8;&#x6210;&#x4E86;&#x4E00;&#x5BB6;&#x6216;&#x51E0;&#x5BB6;&#x5927;&#x4F01;&#x4E1A;&#x7684;&#x79C1;&#x4EBA;&#x6E38;&#x620F;&#xFF0C;&#x5176;&#x5FC5;&#x7136;&#x5931;&#x53BB;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x751F;&#x547D;&#x529B;&#xFF0C;&#x5B83;&#x6216;&#x8BB8;&#x4F1A;&#x5728;&#x5546;&#x4E1A;&#x4E0A;&#x53D6;&#x5F97;&#x6210;&#x529F;&#xFF0C;&#x4F46;&#x662F;&#x90A3;&#x4E2A;&#x6210;&#x529F;&#x4E0D;&#x662F;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x6210;&#x529F;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x9700;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x8BC4;&#x4F30;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x793E;&#x533A;&#x5316;&#xFF08;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#xFF09;&#x7A0B;&#x5EA6;&#x7684;&#x6307;&#x6807;&#x3002;&#x9879;&#x76EE;&#xFF08;&#x5C24;&#x5176;&#x662F;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#xFF09;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x5C5E;&#x6027;&#x662F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x793E;&#x533A;&#x5316;&#x8EAB;&#x4EFD;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x4EE5;&#x5B9E;&#x9645;&#x5411;&#x9879;&#x76EE;&#x8D21;&#x732E;&#x4E86;&#x4EE3;&#x7801;&#x7684;&#x4EBA;&#x5458;&#x7684;&#x793E;&#x533A;&#x5316;&#x79BB;&#x6563;&#x7A0B;&#x5EA6;&#x6765;&#x8BC4;&#x4F30;&#x9879;&#x76EE;&#x7684;&#x793E;&#x533A;&#x5316;&#x7A0B;&#x5EA6;&#x3002;</p>
<p>&#x6BCF;&#x4E2A;&#x53C2;&#x4E0E;&#x9879;&#x76EE;&#x5F00;&#x53D1;&#x7684;&#x4EBA;&#x5458;&#x5747;&#x6709;&#x5176;&#x8EAB;&#x4EFD;&#x5C5E;&#x6027;&#xFF0C;&#x8FD9;&#x4E2A;&#x8EAB;&#x4EFD;&#x53EF;&#x80FD;&#x662F;&#x4F01;&#x4E1A;&#x96C7;&#x4F63;&#x8EAB;&#x4EFD;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x793E;&#x533A;&#x5FD7;&#x613F;&#x8005;&#x8EAB;&#x4EFD;&#x3002;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x5BF9;&#x9879;&#x76EE;&#x7684;&#x63D0;&#x4EA4;&#x4E2D;&#x7684;&#x63D0;&#x4EA4;&#x8005;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x6536;&#x96C6;&#xFF0C;&#x7136;&#x540E;&#x6839;&#x636E;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x8EAB;&#x4EFD;&#x4FE1;&#x606F;&#x3001;&#x90AE;&#x4EF6;&#x540E;&#x7F00;&#x7B49;&#x4F9D;&#x4F18;&#x5148;&#x7EA7;&#x6765;&#x5224;&#x65AD;&#x5176;&#x6240;&#x5C5E;&#x8EAB;&#x4EFD;&#x3002;&#x7136;&#x540E;&#x5BF9;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x8FDB;&#x884C;&#x805A;&#x7C7B;&#xFF0C;&#x4EE5;&#x4E00;&#x4E2A;&#x79BB;&#x6563;&#x8BC4;&#x4F30;&#x6A21;&#x578B;&#x6765;&#x8BC4;&#x4F30;&#x8BE5;&#x6570;&#x636E;&#x96C6;&#x7684;&#x79BB;&#x6563;&#x7A0B;&#x5EA6;&#x3002;</p>
<p>&#x867D;&#x7136;&#x9879;&#x76EE;&#x8D8A;&#x4E2D;&#x5FC3;&#x5316;&#xFF0C;&#x5176;&#x53D1;&#x5C55;&#x98CE;&#x9669;&#x8D8A;&#x9AD8;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x793E;&#x533A;&#x5316;&#x7A0B;&#x5EA6;&#x8D8A;&#x9AD8;&#x7684;&#x9879;&#x76EE;&#x5C31;&#x8D8A;&#x5065;&#x5EB7;&#xFF0C;&#x8FC7;&#x4E8E;&#x79BB;&#x6563;&#x7684;&#x9879;&#x76EE;&#x4E5F;&#x5BB9;&#x6613;&#x51FA;&#x73B0;&#x9879;&#x76EE;&#x5206;&#x88C2;&#x3001;&#x8FED;&#x4EE3;&#x7F13;&#x6162;&#x7B49;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x663E;&#x7136;&#x662F;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x9002;&#x5F53;&#x7684;&#x533A;&#x57DF;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x4E0A;&#x8FF0;&#x4E24;&#x4E2A;&#x6307;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5BF9;&#x9879;&#x76EE;&#x8FDB;&#x884C;&#x8C61;&#x9650;&#x5212;&#x5206;&#xFF0C;&#x4EE5;&#x201C;&#x9879;&#x76EE;&#x6D3B;&#x8DC3;&#x5EA6;&#x201D;&#x548C;&#x201C;&#x793E;&#x533A;&#x5316;&#x7A0B;&#x5EA6;&#x201D;&#x4E3A;&#x4E24;&#x4E2A;&#x8C61;&#x9650;&#x8F74;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="crawler.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 附录二、数据采集综述">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"附录一、研究方法综述","level":"1.4.1","depth":2,"next":{"title":"附录二、数据采集综述","level":"1.4.2","depth":2,"path":"reference/crawler.md","ref":"reference/crawler.md","articles":[]},"previous":{"title":"附录","level":"1.4","depth":1,"ref":"","articles":[{"title":"附录一、研究方法综述","level":"1.4.1","depth":2,"path":"reference/theory.md","ref":"reference/theory.md","articles":[]},{"title":"附录二、数据采集综述","level":"1.4.2","depth":2,"path":"reference/crawler.md","ref":"reference/crawler.md","articles":[]},{"title":"附录三、参与分析账号","level":"1.4.3","depth":2,"path":"reference/accounts.md","ref":"reference/accounts.md","articles":[]},{"title":"附录四、反馈报告问题","level":"1.4.4","depth":2,"path":"reference/contact.md","ref":"reference/contact.md","articles":[]},{"title":"附录五、所有数据","level":"1.4.5","depth":2,"path":"reference/all_data.md","ref":"reference/all_data.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["-lunr"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Grank","pdf":{"pageBreaksBefore":"/","headerTemplate":null,"paperSize":"a4","margin":{"right":62,"left":62,"top":36,"bottom":36},"fontSize":12,"fontFamily":"Arial","footerTemplate":null,"chapterMark":"pagebreak","pageNumbers":false},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"isbn":"","variables":{},"title":"Grank 2019 年度分析报告","links":{"sharing":{"all":null,"facebook":null,"google":null,"twitter":null,"weibo":null},"sidebar":{"Linux.CN":"https://linux.cn"}},"gitbook":"*","description":"Grank 2019 年度分析报告","extension":null},"file":{"path":"reference/theory.md","mtime":"2020-01-05T08:08:11.794Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-01-06T01:52:14.238Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

