
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>洞察 · Grank 2019 年度分析报告</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Grank">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="data.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://linux.cn" target="_blank" class="custom-link">Linux.CN</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="insight.html">
            
                <a href="insight.html">
            
                    
                    洞察
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="data.html">
            
                <a href="data.html">
            
                    
                    数据
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    附录
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="reference/theory.html">
            
                <a href="reference/theory.html">
            
                    
                    附录一、研究方法综述
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="reference/crawler.html">
            
                <a href="reference/crawler.html">
            
                    
                    附录二、数据采集综述
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="reference/accounts.html">
            
                <a href="reference/accounts.html">
            
                    
                    附录三、参与分析账号
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="reference/contact.html">
            
                <a href="reference/contact.html">
            
                    
                    附录四、反馈报告问题
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" data-path="reference/all_data.html">
            
                <a href="reference/all_data.html">
            
                    
                    附录五、所有数据
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="thanks.html">
            
                <a href="thanks.html">
            
                    
                    致谢
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >洞察</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x6D1E;&#x5BDF;">&#x6D1E;&#x5BDF;</h1>
<p>&#x4ECA;&#x5E74;&#x5728;&#x8FDB;&#x884C; GRank &#x6570;&#x636E;&#x5206;&#x6790;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x4E86;&#x4E0D;&#x5C11;&#x6709;&#x8DA3;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x4E00;&#x5E74;&#x65F6;&#x95F4;&#xFF0C;&#x5982;&#x6B64;&#x591A;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x4E5F;&#x503C;&#x5F97;&#x6211;&#x4EEC;&#x601D;&#x8003;&#x548C;&#x5957;&#x8DEF;&#x3002;</p>
<h3 id="&#x6D1E;&#x5BDF;&#x4E00;&#xFF1A;&#x6587;&#x6863;&#x7C7B;&#x6D3B;&#x8DC3;&#x5EA6;&#x53EF;&#x8FBE;&#x5F00;&#x53D1;&#x7C7B;&#x9879;&#x76EE;&#x7684;-10-&#x500D;">&#x6D1E;&#x5BDF;&#x4E00;&#xFF1A;&#x6587;&#x6863;&#x7C7B;&#x6D3B;&#x8DC3;&#x5EA6;&#x53EF;&#x8FBE;&#x5F00;&#x53D1;&#x7C7B;&#x9879;&#x76EE;&#x7684; 10 &#x500D;</h3>
<p>Github &#x9879;&#x76EE;&#x4E0A;&#x4E00;&#x76F4;&#x90FD;&#x6709;&#x4E00;&#x4E9B;&#x6587;&#x6863;&#x7C7B;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x6BD4;&#x5982;&#x5404;&#x79CD; Awesome &#x3001;&#x5404;&#x79CD;&#x7535;&#x5B50;&#x4E66;&#x3002;&#x6211;&#x4EEC;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C; &#x8FD9;&#x4E9B;&#x9879;&#x76EE;&#x7ECF;&#x5E38;&#x4F1A;&#x5F15;&#x8D77;&#x5F00;&#x53D1;&#x8005;&#x8BA8;&#x8BBA;&#xFF1A;<strong>XXX &#x5230;&#x5E95;&#x80FD;&#x4E0D;&#x80FD;&#x7B97;&#x505A;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#xFF1F;</strong>&#x3002; Github &#x5B98;&#x65B9;&#x7684;&#x6001;&#x5EA6;&#x662F;&#x660E;&#x786E;&#x7684;&#xFF0C;&#x6587;&#x6863;&#x7C7B;&#x9879;&#x76EE; azure-docs &#x51FA;&#x73B0;&#x5728;&#x4E86; Github 2019 &#x5E74;&#x5EA6;&#x5F00;&#x53D1;&#x8005;&#x62A5;&#x544A;&#x4E2D;&#x3002;</p>
<p>&#x8FD1;&#x4E24;&#x5E74;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x4F01;&#x4E1A;&#xFF0C;&#x5F00;&#x59CB;&#x5C06;&#x81EA;&#x5DF1;&#x7684;&#x6587;&#x6863;&#x653E;&#x7F6E;&#x5728; Github &#x4E0A;&#xFF0C;&#x4E0E;&#x6574;&#x4E2A;&#x793E;&#x533A;&#x5171;&#x540C;&#x534F;&#x4F5C;&#xFF0C;&#x6784;&#x5EFA;&#x66F4;&#x597D;&#x7684;&#x6587;&#x6863;&#x3002;&#x5728;&#x6B64;&#x6B21;&#x5206;&#x6790;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53D1;&#x73B0;<a href="https://github.com/tencentyun/qcloud-documents" target="_blank">&#x817E;&#x8BAF;&#x4E91;&#x6587;&#x6863;</a>&#x3001;<a href="https://github.com/AlibabaCloudDocs" target="_blank">&#x963F;&#x91CC;&#x4E91;&#x6587;&#x6863;</a>&#x3001;<a href="https://github.com/pingcap/docs-cn" target="_blank">PingCAP</a>&#x7B49;&#x4F01;&#x4E1A;&#x6587;&#x6863;&#x65E9;&#x5DF2;&#x5F00;&#x59CB;&#x5728; Github &#x4E0A;&#x534F;&#x4F5C;</p>
<p>&#x5F53;&#x6211;&#x4EEC;&#x771F;&#x6B63;&#x5C06;&#x6587;&#x6863;&#x7C7B;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x5206;&#x6790;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;<strong>&#x6587;&#x6863;&#x7C7B;&#x9879;&#x76EE;&#x5F97;&#x76CA;&#x4E8E;&#x5176;&#x4F4E;&#x53C2;&#x4E0E;&#x6210;&#x672C;&#x548C;&#x5B66;&#x4E60;&#x6210;&#x672C;&#xFF0C;&#x5728;&#x9879;&#x76EE;&#x7684;&#x6D3B;&#x8DC3;&#x5EA6;&#x5C42;&#x9762;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x6781;&#x9AD8;&#x7684;&#x8BC4;&#x5206;&#xFF0C;&#x540C;&#x6837;&#x7684;&#x539F;&#x56E0;&#xFF0C; &#x6587;&#x6863;&#x7C7B;&#x9879;&#x76EE;&#x4E5F;&#x83B7;&#x5F97;&#x4E86;&#x6781;&#x9AD8;&#x7684;&#x793E;&#x533A;&#x5316;&#x7A0B;&#x5EA6;</strong>&#x3002;&#x6587;&#x6863;&#x7C7B;&#x9879;&#x76EE;&#x5DF2;&#x7ECF;&#x9010;&#x6E10;&#x6210;&#x4E3A;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x73B0;&#x8C61;&#x503C;&#x5F97;&#x6211;&#x4EEC;&#x601D;&#x8003;&#xFF0C;<strong>&#x5728;&#x5F00;&#x6E90;&#x4E16;&#x754C;&#xFF0C;&#x662F;&#x4EE3;&#x7801;&#x91CD;&#x8981;&#xFF0C;&#x8FD8;&#x662F;&#x793E;&#x533A;&#x91CD;&#x8981;&#xFF1F;</strong></p>
<p>&#x4ECA;&#x5E74;&#x7684;&#x6587;&#x6863;&#x7C7B;&#x6D3B;&#x8DC3;&#x9879;&#x76EE;&#x6700;&#x4E3A;&#x4EAE;&#x773C;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x83AB;&#x8FC7;&#x4E8E;&#x6765;&#x81EA;&#x4E8E; <strong>&#x817E;&#x8BAF;&#x4E91;&#x7684; tencentyun/qcloud-documents</strong>&#xFF0C;&#x6B64;&#x9879;&#x76EE;&#x7684;&#x6D3B;&#x8DC3;&#x5EA6;&#x8FDC;&#x8D85;&#x5176;&#x4ED6;&#x9879;&#x76EE;&#xFF0C;&#x603B;&#x6D3B;&#x8DC3;&#x5EA6;&#x8FBE;&#x5230; 685.33 &#xFF0C;&#x662F;&#x540C;&#x7C7B;&#x9879;&#x76EE;&#x7B2C;&#x4E8C;&#x540D;&#x7684; 5 &#x500D;&#xFF0C;&#x5F00;&#x53D1;&#x7C7B;&#x9879;&#x76EE;&#x7B2C;&#x4E00;&#x540D;&#x7684; 10 &#x500D;&#x3002;</p>
<p>&#x8FD1;&#x4E24;&#x5E74;&#xFF0C;&#x6211;&#x4EEC;&#x6B23;&#x559C;&#x7684;&#x770B;&#x5230;&#x5927;&#x91CF;&#x7684;&#x4F01;&#x4E1A;&#x5F00;&#x59CB;&#x5C06;&#x81EA;&#x5DF1;&#x7684;&#x4F01;&#x4E1A;&#x9879;&#x76EE;&#x6587;&#x6863;&#x653E;&#x5728; Github &#x4E0E;&#x793E;&#x533A;&#x5F00;&#x53D1;&#x8005;&#x5171;&#x540C;&#x534F;&#x4F5C;&#xFF0C;&#x83B7;&#x53D6;&#x6765;&#x81EA;&#x793E;&#x533A;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x8D21;&#x732E;&#x3002;&#x5927;&#x91CF;&#x7684;&#x4F01;&#x4E1A;&#x6587;&#x6863;&#x7C7B;&#x9879;&#x76EE;&#x7684;&#x51FA;&#x73B0;&#xFF0C;&#x8868;&#x73B0;&#x51FA;&#x4E86;&#x4F01;&#x4E1A;&#x5BF9;&#x4E8E;&#x5F00;&#x6E90;&#x4EF7;&#x503C;&#x89C2;&#x7684;&#x8BA4;&#x540C;&#x548C;&#x6295;&#x5165;&#x3002;</p>
<h3 id="&#x6D1E;&#x5BDF;&#x4E8C;&#xFF1A;&#x4F01;&#x4E1A;&#x5F00;&#x6E90;&#x6CBB;&#x7406;&#x6C34;&#x5E73;&#x5DEE;&#x5F02;&#x8F83;&#x5927;">&#x6D1E;&#x5BDF;&#x4E8C;&#xFF1A;&#x4F01;&#x4E1A;&#x5F00;&#x6E90;&#x6CBB;&#x7406;&#x6C34;&#x5E73;&#x5DEE;&#x5F02;&#x8F83;&#x5927;</h3>
<p>&#x5728;&#x4ECA;&#x5E74;&#x7684;&#x5206;&#x6790;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x6240;&#x6709;&#x53C2;&#x4E0E;&#x5206;&#x6790;&#x7684;&#x8D26;&#x53F7;&#x8FDB;&#x884C;&#x4F01;&#x4E1A;&#x7EA7;&#x522B;&#x7684;&#x5206;&#x7C7B;&#x3002;&#x901A;&#x8FC7;&#x5206;&#x7C7B;&#x540E;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x660E;&#x663E;&#x770B;&#x51FA;&#x4E0D;&#x540C;&#x4F01;&#x4E1A;&#x5728;&#x5F00;&#x6E90;&#x6CBB;&#x7406;&#x4E0A;&#x7684;&#x6C34;&#x5E73;&#x548C;&#x6210;&#x679C;&#x3002;</p>
<p>&#x4ECA;&#x5E74;&#x53C2;&#x4E0E;&#x5206;&#x6790;&#x7684;&#x7684;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x7684; Github &#x8D26;&#x53F7;&#x6709; 31 &#x4E2A;&#xFF08;&#x6E90;&#x81EA;&#x5176;<a href="https://opensource.alibaba.com/project" target="_blank">&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x5B98;&#x7F51;</a>&#xFF09;&#xFF0C;&#x800C;&#x56FD;&#x5185;&#x5176;&#x4ED6;&#x4E00;&#x7EBF;&#x4E92;&#x8054;&#x7F51;&#x4F01;&#x4E1A;&#x817E;&#x8BAF;&#x4EC5;&#x6709; 4 &#x4E2A;&#x8D26;&#x53F7;&#x3001;&#x767E;&#x5EA6;&#x6709; 12 &#x4E2A;&#x8D26;&#x53F7;&#x3001;&#x534E;&#x4E3A;&#x6709; 7 &#x4E2A;&#x8D26;&#x53F7;&#x3001;&#x7F8E;&#x56E2;&#x6709; 3 &#x4E2A;&#x8D26;&#x53F7;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x8D26;&#x53F7;&#x80CC;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x51FA;&#x7684;&#x662F;&#x5404;&#x4F01;&#x4E1A;&#x5BF9;&#x4E8E;&#x5F00;&#x6E90;&#x7684;&#x6001;&#x5EA6;&#x548C;&#x6CBB;&#x7406;&#x80FD;&#x529B;&#x3002;&#x663E;&#x7136;&#xFF0C;&#x62E5;&#x6709; 31 &#x4E2A;&#x8D26;&#x53F7;&#x7684;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x5728;&#x6CBB;&#x7406;&#x80FD;&#x529B;&#x4E0A;&#x53EF;&#x80FD;&#x4F1A;&#x53D7;&#x5230;&#x8D28;&#x7591;&#xFF0C;&#x4F46;&#xFF0C;31 &#x4E2A;&#x8D26;&#x53F7;&#xFF0C;&#x6362;&#x6765;&#x7684;&#x662F;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x5F00;&#x6E90;&#x751F;&#x6001;&#x3001;&#x58F0;&#x52BF;&#x6700;&#x4E3A;&#x6D69;&#x5927;&#x3002;&#x800C;&#x8D26;&#x53F7;&#x66F4;&#x5C11;&#xFF0C;&#x6CBB;&#x7406;&#x80FD;&#x529B;&#x66F4;&#x5F3A;&#x7684;&#x817E;&#x8BAF;&#x3001;&#x767E;&#x5EA6;&#x3001;&#x534E;&#x4E3A;&#x3001;&#x7F8E;&#x56E2;&#x662F;&#x5426;&#x5C31;&#x505A;&#x7684;&#x66F4;&#x597D;&#x5462;&#xFF1F;&#x4E5F;&#x4E0D;&#x662F;&#x3002;&#x8FD9;&#x4E9B;&#x4F01;&#x4E1A;&#x7684;&#x8D26;&#x53F7;&#x7EF4;&#x62A4;&#x7684;&#x66F4;&#x597D;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x5176;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x58F0;&#x91CF;&#x3001;&#x4F53;&#x91CF;&#x5374;&#x96BE;&#x4EE5;&#x4E0E;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x65D7;&#x4E0B;&#x7684;&#x4F17;&#x591A;&#x9879;&#x76EE;&#x6240;&#x6297;&#x4E89;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x6765;&#x8BF4;&#xFF0C;&#x9762;&#x4E34;&#x7684;&#x95EE;&#x9898;&#x662F;&#x5982;&#x4F55;&#x6559;&#x80B2;&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x4EE5;&#x6B63;&#x5F0F;&#x3001;&#x6B63;&#x89C4;&#x3001;&#x5408;&#x89C4;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x8FD0;&#x8425;&#x3001;&#x8FD0;&#x4F5C;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#xFF0C;&#x800C;&#x5BF9;&#x4E8E;&#x5176;&#x4ED6;&#x4F01;&#x4E1A;&#xFF0C;&#x9762;&#x4E34;&#x7684;&#x95EE;&#x9898;&#x53EF;&#x80FD;&#x662F;&#x5982;&#x4F55;&#x6FC0;&#x52B1;&#x5F00;&#x53D1;&#x8005;&#x53BB;&#x505A;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x3002;</p>
<h3 id="&#x6D1E;&#x5BDF;&#x4E09;&#xFF1A;&#x7A0B;&#x5E8F;&#x5458;&#x4E9A;&#x6587;&#x5316;&#x5174;&#x8D77;">&#x6D1E;&#x5BDF;&#x4E09;&#xFF1A;&#x7A0B;&#x5E8F;&#x5458;&#x4E9A;&#x6587;&#x5316;&#x5174;&#x8D77;</h3>
<p>&#x4E9A;&#x6587;&#x5316;&#x4E00;&#x76F4;&#x662F;&#x4E3B;&#x6D41;&#x6587;&#x5316;&#x7684;&#x4E00;&#x4E2A;&#x9634;&#x5F71;&#xFF0C;&#x4E9A;&#x6587;&#x5316;&#x5F80;&#x5F80;&#x4E0D;&#x4E3A;&#x4EBA;&#x6240;&#x77E5;&#xFF0C;&#x4E0D;&#x4E3A;&#x5E7F;&#x6CDB;&#x7FA4;&#x4F17;&#x6240;&#x63A5;&#x53D7;&#x3002;&#x4F46;&#xFF0C;&#x6570;&#x636E;&#x4E0D;&#x4F1A;&#x9A97;&#x4EBA;&#x3002;&#x5728; 2019 &#x5E74;&#x7684;&#x5E74;&#x5EA6;&#x62A5;&#x544A;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5F15;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x8457;&#x540D;&#x7684;&#x9879;&#x76EE;&#xFF1A;<a href="https://github.com/komeiji-satori/Dress" target="_blank">komeiji-satori/Dress</a>&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5728; Github &#x4E0A;&#x62E5;&#x6709; 16K Stars&#xFF0C;3.2K Forks &#x548C; 198 &#x4F4D; Contriburo &#x7684;&#x9879;&#x76EE;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8BA9;&#x6211;&#x771F;&#x6B63;&#x610F;&#x8BC6;&#x5230;&#xFF0C;&#x4E9A;&#x6587;&#x5316;&#x6216;&#x8BB8;&#x4F9D;&#x7136;&#x66FF;&#x4EE3;&#x4E0D;&#x4E86;&#x4E3B;&#x6D41;&#x6587;&#x5316;&#xFF0C;&#x4F46;&#x4E0D;&#x4EE3;&#x8868;&#x4E9A;&#x6587;&#x5316;&#x5C31;&#x6CA1;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x5B58;&#x5728;&#x4EF7;&#x503C;&#x548C;&#x7A7A;&#x95F4;&#x3002; Dress &#x9879;&#x76EE;&#x7684;&#x8BDE;&#x751F;&#x548C;&#x53D1;&#x5C55;&#xFF0C;&#x662F;&#x4E9A;&#x6587;&#x5316;&#x5411;&#x4E3B;&#x6D41;&#x6587;&#x5316;&#x53D1;&#x58F0;&#x7684;&#x5B58;&#x5728;&#x3002;&#x8FD9;&#x4E9B;&#x6211;&#x4EEC;&#x8FC7;&#x53BB;&#x5FFD;&#x89C6;&#x7684;&#x4E9A;&#x6587;&#x5316;&#xFF0C;&#x6B63;&#x5728;&#x4EE5;&#x81EA;&#x5DF1;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x8868;&#x8FBE;&#x89C2;&#x70B9;&#x3002;</p>
<h3 id="&#x6D1E;&#x5BDF;&#x56DB;&#xFF1A;-javascript-&#x751F;&#x6001;&#x4E0D;&#x65AD;&#x6269;&#x5927;">&#x6D1E;&#x5BDF;&#x56DB;&#xFF1A; JavaScript &#x751F;&#x6001;&#x4E0D;&#x65AD;&#x6269;&#x5927;</h3>
<p>&quot;&#x80FD;&#x88AB; JavaScript &#x6240;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x7EC8;&#x5C06;&#x88AB; JavaScript &#x6240;&#x5B9E;&#x73B0;&quot;&#xFF0C;&#x8FC7;&#x53BB;&#x8FD9;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x6897;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x5728;&#x5982;&#x4ECA;&#xFF0C;&#x8FD9;&#x4E2A;&#x6897;&#x5728;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x9886;&#x57DF;&#x4E2D;&#xFF0C;&#x4E0D;&#x65AD;&#x7684;&#x53D8;&#x6210;&#x4E86;&#x73B0;&#x5B9E;&#x3002;&#x5728;&#x4ECA;&#x5E74;&#x7684;&#x699C;&#x5355;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x5176;&#x4E2D;&#x51FA;&#x73B0;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;</p>
<p>JavaScript &#x5F97;&#x76CA;&#x4E8E;&#x5176;&#x811A;&#x672C;&#x8BED;&#x8A00;&#x7684;&#x7279;&#x6027;&#x548C;&#x5176;&#x7B80;&#x5355;&#x6613;&#x5B66;&#x7684;&#x8BED;&#x6CD5;&#xFF0C;&#x5728;&#x8FD1;&#x51E0;&#x5E74;&#x83B7;&#x5F97;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x5173;&#x6CE8;&#x5EA6;&#x548C;&#x5F00;&#x53D1;&#x8005;&#x3002;&#x800C;&#x5176;&#x65E0;&#x9700;&#x7F16;&#x8BD1;&#xFF0C;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x73AF;&#x5883;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8FD0;&#x884C;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x4E5F;&#x8BA9; JavaScript &#x9879;&#x76EE;&#x5728;&#x6D3B;&#x8DC3;&#x5EA6;&#x7684;&#x63D0;&#x5347;&#x4E0A;&#x5360;&#x636E;&#x4E86;&#x4F18;&#x52BF;&#x3002;&#x76F8;&#x6BD4;&#x4E8E;&#x7F16;&#x8BD1;&#x4E00;&#x6B21;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#x7684; C++ &#x3001;Rust &#x9879;&#x76EE;&#xFF0C;&#x663E;&#x7136; JavaScript &#x4F18;&#x52BF;&#x5341;&#x8DB3;&#x3002;</p>
<h3 id="&#x6D1E;&#x5BDF;&#x4E94;&#xFF1A;&#x670D;&#x52A1;&#x7AEF;&#x76F8;&#x5173;&#x5F00;&#x53D1;&#x4F9D;&#x7136;&#x975E;&#x5E38;&#x91CD;&#x8981;">&#x6D1E;&#x5BDF;&#x4E94;&#xFF1A;&#x670D;&#x52A1;&#x7AEF;&#x76F8;&#x5173;&#x5F00;&#x53D1;&#x4F9D;&#x7136;&#x975E;&#x5E38;&#x91CD;&#x8981;</h3>
<p>&#x867D;&#x7136; JavaScript &#x5360;&#x636E;&#x7684;&#x5E2D;&#x4F4D;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x6240;&#x719F;&#x6089;&#x7684;&#x4F20;&#x7EDF;&#x7684;&#x670D;&#x52A1;&#x7AEF;&#x5F00;&#x53D1;&#x3001;&#x670D;&#x52A1;&#x7AEF;&#x4E2D;&#x95F4;&#x4EF6;&#x7B49;&#x9886;&#x57DF;&#x7C7B;&#x4F9D;&#x7136;&#x662F;&#x5360;&#x636E;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x5E2D;&#x4F4D;&#x3002;&#x5728;&#x4ECA;&#x5E74;&#x7684;&#x6D3B;&#x8DC3;&#x5EA6;&#x699C;&#x5355;&#x524D; 100 &#x540D;&#x4E2D;&#xFF0C;50 &#x4E2A;&#x9879;&#x76EE;&#x662F;&#x670D;&#x52A1;&#x7AEF;&#x5F00;&#x53D1;&#xFF0C;&#x5360;&#x636E;&#x4E86;&#x6240;&#x6709;&#x699C;&#x5355;&#x7684;&#x4E00;&#x534A;&#x4EFD;&#x989D;&#x3002;&#x4E0D;&#x4EC5;&#x5982;&#x6B64;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x95F4;&#x4EF6;&#x9879;&#x76EE; &#x2014;&#x2014; TiDB &#x5360;&#x636E;&#x4E86;&#x975E;&#x6587;&#x6863;&#x7C7B;&#x9879;&#x76EE;&#x7684;&#x6D3B;&#x8DC3;&#x5EA6;&#x699C;&#x5355;&#x7B2C;&#x4E00;&#xFF0C;&#x603B;&#x6D3B;&#x8DC3;&#x5EA6;&#x699C;&#x5355;&#x7B2C;&#x4E09;&#x540D;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x5F00;&#x53D1;&#x8005;&#x6765;&#x8BF4;&#xFF0C;&#x867D;&#x7136;&#x524D;&#x7AEF;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x58F0;&#x91CF;&#x8D6B;&#x7136;&#xFF0C;&#x4F46;&#x670D;&#x52A1;&#x7AEF;&#x5F00;&#x53D1;&#x9879;&#x76EE;&#x4F9D;&#x7136;&#x662F;&#x76EE;&#x524D;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x4E3B;&#x6D41;&#x3002;&#x5BF9;&#x4E8E;&#x5F00;&#x53D1;&#x8005;&#x6765;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x613F;&#x610F;&#x8D21;&#x732E; JavaScript &#x76F8;&#x5173;&#x9879;&#x76EE;&#xFF0C;&#x670D;&#x52A1;&#x7AEF;&#x4E2D;&#x95F4;&#x4EF6;&#x9879;&#x76EE;&#x4F1A;&#x7ED9;&#x4F60;&#x66F4;&#x591A;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
<h3 id="&#x6D1E;&#x5BDF;&#x516D;&#xFF1A;-&#x5404;&#x5BB6;&#x5E03;&#x5C40;&#x7269;&#x8054;&#x7F51;">&#x6D1E;&#x5BDF;&#x516D;&#xFF1A; &#x5404;&#x5BB6;&#x5E03;&#x5C40;&#x7269;&#x8054;&#x7F51;</h3>
<p>&#x4ECA;&#x5E74;&#x7531;&#x4E8E;&#x62C6;&#x5206;&#x4E86;&#x699C;&#x5355;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x80FD;&#x591F;&#x8BA9;&#x6211;&#x4EEC;&#x66F4;&#x52A0;&#x6E05;&#x695A;&#x7684;&#x770B;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x4F01;&#x4E1A;&#x5E03;&#x5C40;&#x3002;&#x4ECA;&#x5E74;&#x7684;&#x7269;&#x8054;&#x7F51;&#x699C;&#x5355;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x4E86;&#x534E;&#x4E3A; 2015 &#x5E74;&#x5F00;&#x6E90;&#x7684; LiteOS &#xFF0C;&#x963F;&#x91CC;&#x5DF4;&#x5DF4; 2017 &#x5E74;&#x5F00;&#x6E90;&#x7684; AliOS-Things &#xFF0C;&#x4E00;&#x76F4;&#x5230; 2019 &#x5E74;&#x7684;&#x7684; TencentOS-Tiny&#xFF08;&#x6B64;&#x9879;&#x76EE;&#x56E0;&#x4E3A;&#x5F00;&#x6E90;&#x65F6;&#x95F4;&#x77ED;&#xFF0C;&#x6D3B;&#x8DC3;&#x5EA6;&#x4E5F;&#x4E0D;&#x9AD8;&#xFF0C;&#x603B;&#x4F53;&#x5065;&#x5EB7;&#x5EA6;&#x6392;&#x540D;&#x5728; 200 &#x540D;&#x5DE6;&#x53F3;&#xFF0C;&#x6545;&#x6CA1;&#x6709;&#x51FA;&#x73B0;&#x5728;&#x540E;&#x7EED;&#x7684;&#x699C;&#x5355;&#x4E2D;&#xFF09;&#xFF0C;&#x5404;&#x5BB6;&#x4F01;&#x4E1A;&#x90FD;&#x5728;&#x79EF;&#x6781;&#x53BB;&#x505A;&#x548C;&#x7269;&#x8054;&#x7F51;&#x76F8;&#x5173;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6559;&#x80B2;&#x5E02;&#x573A;&#x53BB;&#x4E86;&#x89E3;&#x5176;&#x5728;&#x7269;&#x8054;&#x7F51;&#x4E0A;&#x7684;&#x5E03;&#x5C40;&#x3002;&#x5728; 2020 &#x5E74;&#xFF0C;&#x4E0D;&#x77E5;&#x7269;&#x8054;&#x7F51;&#x9886;&#x57DF;&#x53C8;&#x80FD;&#x8BDE;&#x751F;&#x51FA;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x65B0;&#x9879;&#x76EE;&#xFF1F;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: 序言">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="data.html" class="navigation navigation-next " aria-label="Next page: 数据">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"洞察","level":"1.2","depth":1,"next":{"title":"数据","level":"1.3","depth":1,"path":"data.md","ref":"data.md","articles":[]},"previous":{"title":"序言","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-lunr"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Grank","pdf":{"pageBreaksBefore":"/","headerTemplate":null,"paperSize":"a4","margin":{"right":62,"left":62,"top":36,"bottom":36},"fontSize":12,"fontFamily":"Arial","footerTemplate":null,"chapterMark":"pagebreak","pageNumbers":false},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"isbn":"","variables":{},"title":"Grank 2019 年度分析报告","links":{"sharing":{"all":null,"facebook":null,"google":null,"twitter":null,"weibo":null},"sidebar":{"Linux.CN":"https://linux.cn"}},"gitbook":"*","description":"Grank 2019 年度分析报告","extension":null},"file":{"path":"insight.md","mtime":"2020-01-05T23:46:43.988Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-01-06T01:52:14.238Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

